<html>

<head>
<meta http-equiv="expires" content="Wed, 19 Feb 2003 08:00:00 GMT">
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#000066" vlink="#333399" alink="#FF0000">
<pre>


NAME
  cgget - display parameters of cgroup.

SYNOPSIS
  cgget [-a] [-r &lt;name>] [-g &lt;controller>] &lt;path> ...
  or
  cgget [-a] [-r &lt;name>] -g &lt;controller>:&lt;path> ...

DESCRIPTION
Displays the parameter(s) of input cgroup(s).
If no controller is specified, the values of all possible variables are printed.
Either command line style is OK, but these can not be mixed.

-a, --all
print the variables for all controllers which consist in the given path.

-r &lt;name>
defines parameter to display.
This option can be used multiple times.

-g &lt;controller>
defines controllers whose values should be displayed.
This option can be used multiple times.

-g &lt;controller>:&lt;path>
defines control groups whose values should be displayed.
This option can be used multiple times.

-h, --help
display this message.

EXAMPLES
1. display the controller 'cpu' in path '/'
 crash> cgget -g cpu:/
 /:
 cpu.rt_period_us: 1000000
 cpu.rt_runtime_us: 950000
 cpu.stat: nr_periods 0
        nr_throttled 0
        throttled_time 0
 cpu.cfs_period_us: 0
 cpu.cfs_quota_us: 0
 cpu.shares: 1024
 or
 crash> cgget -g cpu /
 /:
 cpu.rt_period_us: 1000000
 cpu.rt_runtime_us: 950000
 cpu.stat: nr_periods 0
        nr_throttled 0
        throttled_time 0
 cpu.cfs_period_us: 0
 cpu.cfs_quota_us: 0
 cpu.shares: 1024
2. display the parameter 'cpuset.mems' in path '/libvirt'
 crash> cgget -r cpuset.mems /libvirt
 /libvirt:
 cpuset.mems: 0
3. display the controller 'cpu' and paramter 'cpuset.mems' at same time
 crash> cgget -r cpuset.mems -g cpu /
 /:
 cpuset.mems: 0
 /:
 cpu.rt_period_us: 1000000
 cpu.rt_runtime_us: 950000
 cpu.stat: nr_periods 0
        nr_throttled 0
        throttled_time 0
 cpu.cfs_period_us: 0
 cpu.cfs_quota_us: 0
 cpu.shares: 1024


</pre>
</html>
